{
  "site": {
    "title": "Broad Sky Tax",
    "language": "en",
    "description": "Your trusted partner in tax preparation and financial consulting.",
    "logo": "/assets/images/Logo.jpg",
    "author": "Broad Sky Tax",
    "social": [
      { "title": "Facebook", "url": "https://facebook.com" },
      { "title": "Twitter", "url": "https://twitter.com" },
      { "title": "Instagram", "url": "https://instagram.com" }
    ],
    "navigation": [
      {
        "text": "Home",
        "url": "/"
      },
      {
        "text": "About",
        "url": "/about/"
      },
      {
        "text": "FAQ",
        "url": "/faq/"
      },
      {
        "text": "Contact Us",
        "url": "/contact/"
      }
    ]
  },
  "pages": [
    {
      "name": "Home",
      "path": "index.md",
      "content": "<h1>Tax Solution built for you</h1><p>Tax filing, planning, and consulting services for business owners and high-net-worth individuals</p>"
    },
    {
      "name": "About",
      "path": "about.md",
      "content": "<p>Broad Sky Tax is a boutique tax service and consulting firm specializing in providing top-quality taxation services to business owners and high-net-worth individuals.</p><p>Our services include annual filings, planning, financial projections, tax optimization, and consulting.</p><p>Our team is comprised of CPAs and IRS Enrolled Agents with decades of experience in public accounting and taxation. We offer more than just tax returns preparation services to our clients. Our CPAs work in collaboration with clients to ensure that our clients have all the information required to make a timely, informed, and prudent financial decision.</p><p>If you are looking for a true partner with the expertise to help you optimize your personal and business finances, please <a href='/broad-sky-tax/contact/'>Contact US</a> to learn more about how we can help you.</p>"
    },
    {
      "name": "Contact Us",
      "path": "contact.md",
      "content": "<h2>Contact Us</h2><p>Have a question? Fill out the form below and we'll get back to you as soon as possible.</p>",
      "google_form_embed_url": "https://docs.google.com/forms/d/e/1FAIpQLSd1A5-zTbm0QivUNpPg-4vvvoAMwXx1sv4z6I0VIWP6xwfyTQ/viewform"
    },
    {
      "name": "FAQ",
      "path": "faq.md",
      "content": "<h2>Frequently Asked Questions</h2><ul><li><strong>Q: Is it better to use TurboTax or a CPA?</strong><br>A: TurboTax is an inexpensive option to prepare simple tax returns. CPAs can help you prepare tax returns if your taxes and investments are more complex.</li><li><strong>Q: Who are your typical clients?</strong><br>A: We believe the clients who can benefit the most from our services are those who are in need of one or more of the following services and are willing and able to engage with us in order to achieve their desired financial outcomes:<ol><li>K1s, either from business or from investment.</li><li>Equity compensations, e.g. RSUs, ISOs, NQSOs, and may subject to 83b election & AMT credit.</li><li>Complex real estate or other investments.</li><li>Complex Tax forms e.g. form 8606</li><li>Small businesses</li><li>Oversea properties</li></ol></li><li><strong>Q: What is your typical tax return preparing process?</strong><br>A: There are five steps in our general tax return preparing process:<ol><li>Initial discovery meeting and service scope determination</li><li>Sign the engagement letter and service agreement</li><li>Submit all your documents and questions in our secured client portal</li><li>Draft tax returns will be delivered for your review.</li><li>Sign your final tax return and enjoy life!</li></ol></li><li><strong>Q: When should I contact the Broad Sky Tax for the 2022 and 2023 tax returns?</strong><br>A: We recommend you contact us immediately if you need help preparing 2022 tax returns. If you need help with 2023 tax returns, we also recommend you contact us as early as possible, so we can identify planning opportunities and tax saving strategies you may be able to adopt in 2023.</li><li><strong>Q: How much do I need to pay for the tax return and planning services?</strong><br>A: Every client’s situation is unique. Therefore, we will determine the fee based on the complexity of each client’s tax returns. We recommend you schedule an initial discussion with us, so we can identify the service scope and give you a more accurate fee quote.</li></ul>"
    }
  ],
  "team": {
    "introduction": "Our team of helpful tax accountants can help you with your individual, partnership tax returns. We have a passion for helping our clients navigate the complexities of the tax code and achieve their financial goals. Our accountants are all certified and have years of experience in the field."
  },
  "tech_stack": {
    "generator": "Eleventy",
    "css": "basic-responsive-css",
    "markdown_support": true
  }
}
